[
  {
        "in": 1,
        "titles": "Bot",
        "section": "Connectivity",
        "shortdescription": "Autonomous artistic agents",
        "tagsstem": "internet, server, network, automation",
        "tagsarts": "interaction, intervention, social, publishing",
        "learningobjectives": "•  To create a program that publishes content online\n•  Develop an applied understanding of working with a server\n•  Exploration of the API of a online platform.\n",
        "brief": "Create a publishing bot that posts to an online social media platform. Your bot might explore a particular issue, publish generated content, perform a character, communicate an emotional disposition, draw on content from a source text, or promote a political agenda. It may be a publishing platform, intermidently publishing content to an audience, or it may be programmed to be social, interacting with other users online. Explore the possible interactions afforded by the API of your chosen platform allows.\n\n\n",
        "variations": "•  Beginners can start by using an online notification service such as If This Then That (IFFT) to automate online interactions with minimal coding.\n•  Create a bot that responds to an online datastream or archive such as that of the New York Times. This will likely require you to navigate another API in addition to that of the social media platform where you are publishing their content. \n•  Tailor your bot so that it reveals something interesting about the API of the online platform you are using. ",
        "advancedstudents": "Deploy your bot on a remote server and set up a scheduler like a cron job so your bot published intermittently.",
        "makingitmeaningful": "A bot is a software agent that acts autonomously. The promise and peril of bots have inspired characters like HAL in 2001: A Space Odyssey and they've long been explored in computer science and natural language research manifesting in examples like Eliza, the first chatbot to pass the Turing test. Machine learning techniques continue to progress natural language bots to function as assistents, translators or potentially even companions in online spaces.\n\nBots are now so widely used on the internet that some researchers estimate that over half of all traffic is generated by these non-human agents. Search engines bots to crawl the web and index content and huge collections of bots form botnets to compromise online services through DDoS attacks. Social media bots are created for a multitude of agendas and bot maker Allison Parrish offers a model for defining poetic or artistic bots called \"PUDG\" - procedural, uncreative, data-driven graffetti (Parrish, 2016). Social media bots can be platforms for the publication of artistic, literary or scientific content to online audiences like in Katie Rose Pipkin’s @mothgenerator, Alison Parish’s @everyword or NASA’s @LandsatBot. They can be conversation simulators or they can act with political or social agendas like the @congressedits Twitter bot that tweets everytime a IP address located in congress changes a Wikipedia entry or the @dronestagram Instagram bot that shows satellite images of drone strike locations. \n",
        "titlegray": 1,
        "aspirationcaptions": "Horse Ebooks https://twitter.com/Horse_ebooks\nEvery word, Allison Parrish https://twitter.com/everyword\nRandom Darknet Shopper, https://wwwwwwwwwwwwwwwwwwwwww.bitnik.org/r/\nKatie Rose Pipkin, Moth Generator. https://twitter.com/mothgenerator\nDarius Kazemi, Two Headlines. https://twitter.com/TwoHeadlines\nCongress Edits, https://twitter.com/congressedits",
        "additionalreferences": "Allison Parish essay: https://points.datasociety.net/bots-a-definition-and-some-historical-threads-47738c8ab1ce#.z3eub1bpl\nKatie Rose Pipkin, Bots\nOn Kawara, Pall Thayer, https://twitter.com/On_Kawara\nDarius Kazemi \nNSA Haiku Generator \nArt Assignment Bot, https://twitter.com/artassignbot\nNSA Haiku Generator, http://www.nsahaiku.net/\nPost the Met, Tega Brain https://twitter.com/postthemet\nNYPL Emoji Bot, https://twitter.com/nyplemoji\nCongress Edits, https://twitter.com/congressedits\nBot Summit \nDronestagram, James Bridle\nKeyTweeter, Kyle Mcdonald?\nHow to Sext, https://twitter.com/wikisext?lang=en\nhttps://datasociety.net/blog/2016/02/24/apb-talking-bots/\nTop Gun Bot, Ramsey Nasser. https://twitter.com/555uhz\nDo Not Pay: http://www.donotpay.co.uk/signup.php\nTalking with Machines, http://www.radiolab.org/story/137407-talking-to-machines/\nAmerican Census, https://twitter.com/censusamericans"
    }
  ]
