[
    {
        "in": 1,
        "titles": "Experimental Chat",
        "section": "Connectivity",
        "shortdescription": "interrogating 'togetherness'",
        "level": "Intermediate-advanced",
        "tagsstem": "multi-user, text, internet, client-server communication, sockets",
        "tagsarts": "social, interactivity, translation, multimodal communication, dasein ",
        "learningobjectives": "•  Understand how to set up a basic webserver.\n•  Gain experience working with a backend web framework.\n•  Design, develop and execute a concept for a social space.",
        "brief": "Develop a multi-user environment that allows people in different locations to communicate with each other in a new way. Your system could facilitate language-based interactions like typing, speaking or reading. Or it could convey other aspects of presence, such as gesture, breath or body dynamics, to explore what Heidegger calls *dasein*, or “being there together”. Carefully consider the *agency* of participants in your system, and the *timing* and *directionality* of their messages. Are the users passive observers, listening to the murmurings of a crowd, or are they contributors to a grand conversation? Is communication asynchronous, wherein a user’s traces are encountered by others later? Or is it synchronous, allowing for simultaneous participation in a live event? Is your system intended for one-to-one, one-to-many, one-to-many, or many-to-many?",
        "variations": "•  Develop multi-user performance space for theater or performance. How can developing a medium through which participants are connected, augment or modify collaborative practices such as these?",
        "advancedstudents": "•  Create a multiuser environment where one user is an artificial intelligence. You may choose to use natural language processing tools such as Eliza or Rita or create one of your own. \n•  Develop a Multi-User Dungeon (MUD) game which incorporates a chat room. A MUD is an interactive text based game where users collaborate to solve problems and progress the narrative. The first MUD was developed in 1978 and served as one of the earliest online chat rooms, making this variation a rich opportunity to study gaming history. Traditionally these were role-playing games and users would choose to join a specific domain based on common interests.",
        "makingitmeaningful": "One of the most evocative experiences offered by digital networks is being connected to someone when physically apart. The creatation of social spaces has characterised networked computation since its inception with some of the earliest chat programs being written in the 1960s and 1970s. The decades that followed the development of the internet brought bulliten board systems, MUDs, text based protocols such as IRC, the public chat rooms of the 1990s and, more recently, instant messanger services and multiuser documents. The magic of first using a multiuser shared document, where changes update in real time is hard to overemphasize to younger students accustomed to such tools.\n\nOf course communication is not confined to language and explorations of multi-modal communication spaces has long concerned media artists. Telepresence works pioneered ways to connect separated audiences prior to the ubiquity of the internet. Kit Galloway and Sherrie Rabinowitz’s Hole in Space (1980) is an early example using video. Multi-user drawing tools like MotionPhone (1990) by Scott Snibbe also shows early experiments developing collaborative creative tools. This assignment could be further focused on gesture or on autonomic body functions.",
        "titlegray": 255,
        "fullpageimage": "chat/hole_in_space_large.jpg",
        "layout": 22,
        "image": "chat/listening_post_2.jpg\nchat/the_trace.jpg\nchat/motion_phone_2.jpg\nchat/poop_chat_pro_2.jpg",
        "imageborders": "0\n0\n0\n1",
        "aspirationcaptions": "1. *Hole in Space* by Kit Galloway and Sherrie Rabinowitz (1980) is a pioneering example of telepresence works as it connected audiences between Times Square in New York City and Los Angeles. https://www.youtube.com/watch?v=SyIJJr6Ldg8\n\n2. *Listening Post* (2001) Mark Hansen and Ben Rubin publicly displays phrases from conversations taken from public online chatrooms.\n\n3. *The Trace* (1995) by Raphael Lozano Hemmer, one participant encounters the presnence of another person located in an identical but separate room. Each is conveyed to the other in light. http://www.lozano-hemmer.com/the_trace.php\n\n4. *Motion Phone* (1995) Scott Snibbe is an early example of a collaborative drawing environment. Users are able to zoom in and draw at multiple scales. http://www.snibbe.com/projects/interactive/motionphone/\n\n5. *Poop Chat Pro*, (2016) Maddy Varner is an asynchonous chat space where messages are deposited as quivering animations for others to find later.",
        "additionalreferences": "Sam Lavigne and Useless Press.*PckWck* (2015).\nWafaa Bilal. *Domestic Tension*  (2007) http://wafaabilal.com/domestic-tension/\nExonemo. *The Internet Bedroom* (2015) http://idpw.org/bedroom/\nJenny Holtzer. *Trusim*  (1997) http://www.medienkunstnetz.de/works/truisms/ \nJilian Mayer *The Sleep Site* (2012) http://aplaceforonlinedreaming.com/\nChat.meatspac.es. *Soledad Penadés*, https://chat.meatspac.es/\nZach Gage. *Can we talk* (2011) https://vimeo.com/27421540\nJingwen Zhu. *Real Me* http://www.jingwen-zhu.com/real-me/ \nKen Goldberg and Joseph Santarromana, (1995) Telegarden. http://www.ieor.berkeley.edu/~goldberg/garden/Ars/\nKyle McDonald, (2015) Exhausting a Crowd. http://www.exhaustingacrowd.com/london \nTwistori, http://twistori.com/ \nMoniker - https://studiomoniker.com/projects/out-of-line\n",
        "notes": "Considerations: \nRole of the user: viewer or contributor: Are you just listening to the murmurings of a crowd, or able to contribute to it\nAsynchronous vs. Synchronous: participating in a live event, or contributing to a graffiti wall\nTextual or multimodal: Am I typing/speaking/reading, or am i using gesture, breath, my body\n\n\n"
    },
    {
        "in": 1,
        "titles": "Bot",
        "section": "Connectivity",
        "shortdescription": "Autonomous artistic agents",
        "tagsstem": "internet, server, network, automation",
        "tagsarts": "interaction, intervention, social, publishing",
        "learningobjectives": "•  To create a program that publishes content online\n•  Develop an applied understanding of working with a server\n•  Exploration of the API of a online platform.\n",
        "brief": "Create a \"bot\" that posts to an online social media platform. Your bot might explore a particular issue, publish generated content, perform a character, communicate an emotional disposition, interact with users, draw on content from a source text, or promote a specific agenda. It may be a publishing platform, intermittently publishing content to an audience of online subscribers, or it may be programmed to be a social actor, interacting with other users online. Explore the different possible interactions afforded by the API of your chosen platform.\n \n\n\n",
        "variations": "•  Beginners can start by using an online notification service such as *If This Then That* (IFTTT) to automate online interactions with minimal coding.\n•  Create a bot that responds to an online datastream or archive such as that of the New York Times. This will likely require you to navigate another API in addition to that of the social media platform where you are publishing their content. \n•  Tailor your bot so that it reveals something interesting about the API of the online platform you are using. ",
        "makingitmeaningful": "A bot is a software agent that acts autonomously and their promise and peril have inspired numerous fictionsal characters like HAL in 2001: A Space Odyssey. Natural language researchers developed early chatbots like Eliza which was the first program to pass the Turing test. Machine learning and natural language processing continue to be developed with the aim of making bot assistents, translators or potentially even companions that can learn as they interact with users. \n \nBots are so widely used online that researchers estimate over half of all traffic is generated by non-human agents. Search engine bots to crawl the web indexing content and botnets compromise online services through DDoS attacks. Social media bots publish artistic, literary and scientific content to online audiences with bot maker Allison Parrish offering a model for defining poetic or artistic bots called “PUDG” - procedural, uncreative, data-driven graffetti (Parrish, 2016). Bots like @aLonelyProject socialize with human users or can be designed to act with political agendas, see the @congressedits Twitter bot that tweets Wikipedia edits made from IP addresses located in congress or James Briddel’s @dronestagram bot that posts satellite images of drone strike locations. \n",
        "titlegray": 0,
        "fullpageimage": "bot/pipkin.jpg",
        "layout": 1,
        "image": "bot/quarter_bitnik.jpg\nbot/quarter_everyword.jpg\nbot/quarter_osc.jpg\nbot/quarter_cspan_white.jpg",
        "imageborders": "0\n1\n1\n1",
        "aspirationcaptions": "1. Katie Rose Pipkin and Loren Schmidt's Moth Generator is a Twitter bot that creates digital images of moths accompanied by generated nomenclatures for each specimen. https://twitter.com/mothgenerator\n2. Random Darknet Shopper by !Mediengruppe Bitnik is an online shopping bot allocated $100 per week for purchases from the Darknet, https://wwwwwwwwwwwwwwwwwwwwww.bitnik.org/r/\n3. Reverse OCR by Darius Kazemi is a tumblr bot that takes a random word and draws semi random line until an OCR library recognizes the resultant image as the word. http://reverseocr.tumblr.com/\n4. In 2007 Allison Parrish created Twitter bot Everyword, that tweeted every word in the English language. https://twitter.com/everyword\n5. CSPAN5 by Sam Lavigne is a Youtube bot that automatically edits videos from the CSPAN channel reducing them to the most frequently stated words and phrases. https://twitter.com/CSPANFive",
        "additionalreferences": "http://p-dpa.net/work/twitter-bot-encyclopedia/\nAllison Parish essay: https://points.datasociety.net/bots-a-definition-and-some-historical-threads-47738c8ab1ce#.z3eub1bpl\nDarius Kazemi, Two Headlines. https://twitter.com/TwoHeadlines\nCongress Edits, https://twitter.com/congressedits\nKatie Rose Pipkin, Bots\nOn Kawara, Pall Thayer, https://twitter.com/On_Kawara\nDarius Kazemi \nNSA Haiku Generator \nArt Assignment Bot, https://twitter.com/artassignbot\nNSA Haiku Generator, http://www.nsahaiku.net/\nPost the Met, Tega Brain https://twitter.com/postthemet\nNYPL Emoji Bot, https://twitter.com/nyplemoji\nCongress Edits, https://twitter.com/congressedits\nBot Summit \nDronestagram, James Bridle\nKeyTweeter, Kyle Mcdonald?\nHow to Sext, https://twitter.com/wikisext?lang=en\nhttps://datasociety.net/blog/2016/02/24/apb-talking-bots/\nTop Gun Bot, Ramsey Nasser. https://twitter.com/555uhz\nDo Not Pay: http://www.donotpay.co.uk/signup.php\nTalking with Machines, http://www.radiolab.org/story/137407-talking-to-machines/\nAmerican Census, https://twitter.com/censusamericans\nSurya Mattu, https://twitter.com/nypostpoetics"
    }
]
