[
    {
        "in": 1,
        "titles": "Bot",
        "section": "Connectivity",
        "shortdescription": "Autonomous artistic agents",
        "tagsstem": "internet, server, network, automation",
        "tagsarts": "interaction, intervention, social, publishing",
        "learningobjectives": "•  To create a program that publishes content online\n•  Develop an applied understanding of working with a server\n•  Exploration of the API of a online platform.\n",
        "brief": "Create an autonomous software agent, \"a bot\", that posts to an online social media platform. Your bot might explore a particular issue, publish generated content, perform a character, communicate an emotional disposition, interact with users, draw on content from a source text, or promote a specific agenda. It may be a publishing platform, intermittently publishing content to an audience of online subscribers, or it may be programmed to be a social actor, interacting with other users online. Explore the different possible interactions afforded by the API of your chosen platform.\n \n\n\n",
        "variations": "•  Beginners can start by using an online notification service such as *If This Then That* (IFTTT) to automate online interactions with minimal coding.\n•  Create a bot that responds to an online datastream or archive such as that of the New York Times. This will likely require you to navigate another API in addition to that of the social media platform where you are publishing their content. \n•  Tailor your bot so that it reveals something interesting about the API of the online platform you are using. ",
        "hyphenatemim": 0,
        "makingitmeaningful": "Online bots can publish artistic, literary and scientific content to new audiences and offering new opportunities for creative expression and connecting with online audiences. Bot maker Allison Parrish understands practices of poetic or artistic bot making as “PUDG” - procedural, uncreative, data-driven graffetti (Parrish, 2016). They can interact with human users, publish real time data in affective ways or act with specific political agendas. Bots are so prevalent online that it has been estimated that over half of all internet traffic is generated by non-human agents. Search engines use them to collect data by indexing web content and groups of bots, botnets, coordinate action like DDoS attacks to compromise online services.\n\nBots and the artificial intelligence underlying them inspire both hope and anxiety, duel sentiments made palpible in fictional depications like HAL from 2001: A Space Odyssey. Since the 1950s, natural language and AI researchers have developed chatbots like Eliza and Rita, with Eliza being the first to pass the Turing test. This field continues to florish with the release of bots that learn and evolve through interactions with users. These function as assistents, translators and potentially even companions.\n",
        "titlegray": 0,
        "fullpageimage": "bot/pipkin.jpg",
        "layout": 19,
        "image": "bot/ephemerides.jpg\nbot/quarter_osc.jpg\nbot/pipkin_one_third.jpg\nbot/quarter_bitnik.jpg\nbot/lublin.jpg",
        "imageborders": "0\n1\n1\n1",
        "aspirationcaptions": "1. Katie Rose Pipkin and Loren Schmidt's *Moth Generator* (2015) is a Twitter bot that synthesizes digital images of moths accompanied by generated nomenclatures for each specimen. https://twitter.com/mothgenerator\n2. Random Darknet Shopper by !Mediengruppe Bitnik is an online shopping bot allocated $100 per week for purchases from the Darknet, https://wwwwwwwwwwwwwwwwwwwwww.bitnik.org/r/\n3. Reverse OCR by Darius Kazemi is a tumblr bot that takes a random word and draws semi random line until an OCR library recognizes the resultant image as the word. http://reverseocr.tumblr.com/\n4. In 2007 Allison Parrish created Twitter bot Everyword, that tweeted every word in the English language. https://twitter.com/everyword\n5. CSPAN5 by Sam Lavigne is a Youtube bot that automatically edits videos from the CSPAN channel reducing them to the most frequently stated words and phrases. https://twitter.com/CSPANFive",
        "additionalreferences": "http://p-dpa.net/work/twitter-bot-encyclopedia/\nAllison Parish essay: https://points.datasociety.net/bots-a-definition-and-some-historical-threads-47738c8ab1ce#.z3eub1bpl\nDarius Kazemi, Two Headlines. https://twitter.com/TwoHeadlines\nCongress Edits, https://twitter.com/congressedits\nKatie Rose Pipkin, Bots\nOn Kawara, Pall Thayer, https://twitter.com/On_Kawara\nDarius Kazemi \nNSA Haiku Generator \nArt Assignment Bot, https://twitter.com/artassignbot\nNSA Haiku Generator, http://www.nsahaiku.net/\nPost the Met, Tega Brain https://twitter.com/postthemet\nNYPL Emoji Bot, https://twitter.com/nyplemoji\nCongress Edits, https://twitter.com/congressedits\nBot Summit \nDronestagram, James Bridle\nKeyTweeter, Kyle Mcdonald?\nHow to Sext, https://twitter.com/wikisext?lang=en\nhttps://datasociety.net/blog/2016/02/24/apb-talking-bots/\nTop Gun Bot, Ramsey Nasser. https://twitter.com/555uhz\nDo Not Pay: http://www.donotpay.co.uk/signup.php\nTalking with Machines, http://www.radiolab.org/story/137407-talking-to-machines/\nAmerican Census, https://twitter.com/censusamericans\nSurya Mattu, https://twitter.com/nypostpoetics"
    },
    {
        "in": 1,
        "titles": "Augmented Projection",
        "section": "Transmediality",
        "shortdescription": "Illuminated interventions",
        "level": "All levels ",
        "tagsstem": "perspective geometry, computer vision, calibration, optics, simulation",
        "tagsarts": "site, visualization, animation, light-play, graffiti, intervention, defamiliarization, historicization, architectural politics, public space",
        "learningobjectives": "•  Review techniques for working with projectors.\n•  Use code and light to create relationships between real and virtual, physical and digital.\n•  Design and realize a site-specific artistic concept or augmented reality experiment.",
        "brief": "Design a virtual decal for a physical place or object: a time-based projection of graphics or video which is specifically composed to illuminate a chosen site *other* than a blank projection screen. Your imagery might relate to (and elicit new meanings from) otherwise banal architectural features in a wall, such as a power outlet, doorknob, water spigot, elevator buttons, window frame, door jamb, etc. You might design a projection for a specific object, or, if you are able, for a dynamic site such as a vehicle or performer’s body.\n\nSketch some poetic concepts for imagery that relates in a non-arbitrary way to the (geometric, structural, historical, political...) features of your site. Create your concept in code, and project your imagery onto your site or object, taking special care to document it.",
        "variations": "•  Reinterpret a classic arcade game, such as Pong, Snake, Qix, or Pac-Man, so that it uses a specific wall as a playing field. Be sure to incorporate features of the wall into the game.\n•  Create an audiovisual presentation in which features of a real environment are activated by colored projections, synchronized to music.\n•  Create an \"in-situ data visualization\", which projects information *about* a site onto that site. This could take the form of a superimposed “x-ray”, datagraph, political commentary, etc.\n•  If your design requires precise alignment between virtual and physical spaces, you’ll need a tool for projector calibration and keystone correction. Consider Keystonep5 (for Processing), ofxWarp (for openFrameworks) or software like Millumin or TouchDesigner.\n•  Consider using a physics library, such as Box2D, to orchestrate realistic-looking “collisions” between your projected graphics and the actual physical features of your site.\n•  Give consideration to scale. Small is OK.",
        "advancedstudents": "•  Use computer vision to assist with feature detection, projector calibration and alignment.\r\n•  Using simulation principles such as flocking, create an ecosystem of virtual creatures that are projected onto a chosen wall, and which respond to its features.",
        "hyphenatemim": 0,
        "makingitmeaningful": "A wide range of new meanings awaits when an illuminated virtual layer is superimposed onto the physical world. Projection can operate as a *commentary* or critique: an intervention to probe the historical or political dimensions of a building or monument. In other uses, the projection is a site-specific information *visualization,* revealing the internal structures of places or objects, the activities that occur in relation to them, or the resources required in their operation. In performance contexts, projections have created new opportunities for responsive set designs, shadow-play, and choreographies of “digital costumes”: responsive, projected displays that are tightly coupled to a performer’s body and movements. Augmented projections range from spectacular public illusions that make buildings appear to shimmer, through to intimate poetic gestures at the scale of the human face.\n\nThe key challenge is to create a strongly motivated relationship between real and virtual: that is, between the projected light, and the specific person, place or thing on which it is projected. Exemplary works accomplish this through a combination of both rigorous *formal* and *conceptual* engagement with site. Choices about what to project on, and what to project on it, are made simultaneously. ",
        "titlegray": 255,
        "fullpageimage": "augmented_projection/wodiczko_fullpage.jpg",
        "layout": 20,
        "image": "augmented_projection/naimark_displacements_quarter_1.jpg\naugmented_projection/mckay_sunsetsolitaire_quarter.jpg\naugmented_projection/nuage_vert_onethird.jpg\naugmented_projection/jillian_mayer_onethird_6.jpg\naugmented_projection/obermaier_apparition_onethird_1.jpg",
        "imageborders": "0\n0\n0\n0\n0",
        "aspirationcaptions": "1. Krysztof Wodiczko’s *Warsaw Projection* (2005) augmented the façade of the Zachęta National Gallery to focus on the unequal social status of women. Videos of women supporting an entablature inscribed “Artibus” (arts) were presented as architectural Caryatids. http://www.art21.org/artists/krzysztof-wodiczko\n\n2. In Michael Naimark’s *Displacements* (1980), video of a room-sized still life is projected back onto the selfsame scene, painted white. http://www.naimark.net/projects/displacements.html\n\n3. In *Sunset Solitaire* (2007), Joe McKay uses custom software to perform a projection which “matches” the sunset. http://www.joemckaystudio.com/sunset.php\n\n4. *Nuage Vert* (2008), by Helen Evans and Heiko Hansen, visualizes a power plant’s energy consumption with a projected laser outline. https://vimeo.com/17350218\n\n5. In *Scenic Jogging* (2010), Jillian Mayer enters a landscape projected from a moving vehicle. https://youtu.be/uMq9Th3NgGk\n\n6. *Apparition* (2004), by Klaus Obermaier and the Ars Electronica Futurelab, uses computer vision to project imagery onto a moving dancer.   ",
        "additionalreferences": "AntiVJ. *O (Omicron)* (2012). https://vimeo.com/41486619 \nBaker, Chris. *Architectural Integration Tests* (2009). https://vimeo.com/4500145.\nCone, Justin. \"Building Projection Roundup\". *Motionographer.com*, 7/24/2009.\nForman, Eric. *Perceptio Lucis* (2009). http://www.ericforman.com/perceptio-lucis\nGaulon, Benjamin. *DePong* (2003). http://recyclism.com/deponggame.php\nGuidetti, Michael. *Bounce Room* (2010). https://youtu.be/oM5rAQ9NeyQ\nGysin+Vanetti, *Casse* (2006). http://youtu.be/WY5o2plCfKk\nMomeni, Ali and Stephanie Sherman. *Manual for Urban Projection*, 2014. http://c-uir.org/\nMunk, Bradley et al.: *BOX* (2013). http://gmunk.com/BOX-DEMO\nMurano, Francesco. \"Light Works: Experimental Projection Mapping\", 2014. \nSobecka, Karolina. *Wildlife* (2009). http://www.gravitytrap.com/artwork/wildlife\nStudio Moniker. The Designer’s Guide to Over-projection (2013). https://vimeo.com/74294915\nSugrue, Chris. *Delicate Boundaries* (2006). http://csugrue.com/delicateboundaries/\nValbuena, Pablo. *Augmented Sculpture* (2007). https://vimeo.com/34623832\nYesYesNo. *Night Lights* (2011). https://vimeo.com/26778535",
        "notes": "http://cmuems.com/2013/a/assignments/assignment-07/\nhttp://golancourses.net/2015/lectures/interactivity/full-body-interactive-art/\n\npublic space, new audiences, public art. Relationship to the architecture. Geometric, political, architecture and site has an important history. Opportunity for intervention. What makes so many of the eaxmples so poor is that they are purely geometric relationship - this is a great starting point. Making buildings appear to shake and shimmer. But the work obtains special power when it also relates to the history and meaning of site - as wodisko demonstrates. \nPerformance wise- augmented dance projection. \nA wide range of new meanings and experiences can be produced when an illuminated virtual layer is superimposed onto the physical world. In some works, the light projection can operate as a *commentary* or institutional critique: an ephemeral intervention which probes deeper conceptual, historical or political dimensions of a building or monument. In others, the projection is a site-specific information *visualization*, revealing the internal structures of places or objects, the behaviors and activities that occur in relation to them, or the resources required in their operation. In performance and installation contexts, projections have created new opportunities for responsive set designs, shadow-play, and a choreography of \"digital costumes\": responsive, projected displays that are tightly coupled to a performer's body and movements. In scale, augmented projections range from spectacular public illusions that make buildings appear to shimmer and shake, to intimate poetic gestures at the scale of the human face or hand. \n\nThe artist or designer's core challenge is to create a strongly motivated relationship between the real and virtual: that is, between the projected light or imagery, and the specific person, place or thing on which it is projected. Exemplary works of augmented projection accomplish this through a combination of both rigorous *formal* and *conceptual* engagement with site. The creator establishes geometric relationships between the projected image and its canvas (in which the projected image appears to respond or relate to inherent features of the site), but also goes deeper than the site's surface in addressing or amplifying the charged potentials of its history, identity and politics. Choices about what to project on, and what to project on it, are made simultaneously. "
    }
]
