[
    {
        "heading": "Exercises: Curves",
        "exercisetitle": "A circle in three ways.",
        "descriptions": "There are an infinite amound of ways that you can render curves. Plot a circle in three different ways, you might combine several curves, lines or other geometric elements to do this. Be creative, there are no wrong answers. (1)",
        "imagename": "exercises/curves/circle.png",
        "verticalspace": 1
    },
    {
        "heading": "Exercises: Curves",
        "exercisetitle": "Spiral",
        "descriptions": "Plot a spiral in code.",
        "imagename": "exercises/curves/spiral.png",
        "verticalspace": 1
    },
    {
        "heading": "Exercises: Curves",
        "exercisetitle": "Mathworld curves.",
        "descriptions": "Browse the website: http://mathworld.wolfram.com/topics/Curves.html and select a curve. Please note that not every Mathworld curve comes with a helpful diagram or an easy-to-implement equation.  We recommend selecting curves whose equations take one of the following standard forms: the standard explicit form y = f(x), or curves which take the parametric form y = f(t), x = g(t), or curves with the polar form r = f(theta). Create a simple interaction in which the mouseX and mouseY are used to continuously govern at least one (and preferably at least two) parameters of the curve.",
        "imagename": "exercises/curves/mathworld.png",
        "verticalspace": 2
    },
    {
        "heading": "Exercises: Curves",
        "exercisetitle": "Butt Generator",
        "descriptions": "Code a program that generates animations of a butt. It should change shape, size and color. How variable can a butt be before it's not a butt? (3)",
        "imagename": "exercises/curves/butt.png",
        "verticalspace": 1
    },
    {
        "heading": "Exercises: Curves",
        "exercisetitle": "Text along a curve",
        "descriptions": "Code a program that displays a phrase to the screen, where each letter follows the curve of a line. You will need to treat each character individually. (4)",
        "imagename": "exercises/curves/textcurve.png",
        "verticalspace": 1
    },
    {
        "heading": "Exercises: Curves",
        "exercisetitle": "Phyllotaxis",
        "descriptions": "Use Turtle Graphics to generate a phyllotactic spiral comprised of small geometric elements. Have your turtle start drawing at the center of the canvas.\nAt each step in the spiral, your turtle should draw a small regular polygon, such as a small hexagon. Be sure to have your turtle use the Golden Angle, ~137.507764°, to reckon where to place the next seed. (5)",
        "imagename": "exercises/curves/phyll.png",
        "verticalspace": 2
    },
    {
        "heading": "Exercises: Curves",
        "exercisetitle": "Continuity of Bezier Curves",
        "descriptions": "Creating a curve by joining two Bezier curves. Position the control points of each curve so that their slope continuity is not disrupted at the point of the join.",
        "imagename": "exercises/curves/bezier.png",
        "verticalspace": 1
    },
    {
        "heading": "Exercises: Curves",
        "exercisetitle": "Circle Morphing",
        "descriptions": "Create a program that interpolates between a circle and a square (or triangle). ",
        "imagename": "exercises/curves/circlesquare.png",
        "verticalspace": 1
    },
    {
        "heading": "Exercises: Curves",
        "exercisetitle": "References",
        "descriptions": "1. Yuki Yoshida, Drawing a Circle Code Repository. Online: https://github.com/yukiy/drawCircle\n2. See the mathworld website: http://mathworld.wolfram.com/topics/Curves.html\n3. See http://www.buttgenerator.com/ \n4. See the Daniel Shiffman tutorial, Strings and Drawing Text on the Processing website: https://processing.org/tutorials/text/\n5. See Assignment 90-B: Turtle’s Phyllotactic Spiral from Golan Levin's Compuation for Creative Practices syllabus. Online: http://cmuems.com/2015c/deliverables/deliverables-09/#spiral",
        "verticalspace": 2
    }
]
