[
  {
         "in": 1,
         "titles": "Software Instrument",
         "shortdescription": "Virtual synasthesia",
         "level": "Introduction",
         "tagsstem": "Trigonometry, events, libraries, interaction design.",
         "tagsarts": "timbre, translation, rhythm, composition, harmony",
         "learningobjectives": "•  Apply the principles of interaction design to design a software instrument.\n•  Creatively explore ways to connect sound and visuals.\n•  Develop an understanding of event driven programming.",
         "brief": "Design and code a software instrument that richly couples sonic and visual outputs. Your instrument should be an tool for muscial composition. It must be able to be played and interactions should yield a predictable results. \n\nCarefully consider the interaction design of your instrument. Your program might trigger prerecorded or collected sounds or it could synthesize them using a sound synthesis library. If you are collecting sounds, consider where they are sourced from and how this ties into your concept. Will you create a collection of recordings of a particular phenomena or source media? Consider compositional elements such as musical scale, the timbre of the sounds produced and the variability of these things.",
         "variations": "Make an instrument where interactions are defined by mouse or keyboard operations.",
         "advancedstudents": "Explore more unusual interactions using a camera, computer vision or a sensor.\n",
         "makingitmeaningful": "Synesthesia couples one sense with another and those with the condition report of hearing images, tasting sounds or seeing images. Similarly, designing tools for translating between the senses has been an ongoing source of inspiration for creators as can be seen in the rich history of color organs that spans centuries. Since the 1700s examples of color organs pair sounds and colors using key triggered popup panels, curtains that opened to show colored plates or later, with the invention of electricity, colored lights and projections. Along with these elaborate inventions, various artists, scientists and thinkers have attempted to design color scales, systems that structure correspondences between the elements of color (hue, saturation and value) and those of sound (pitch, amplitude, and tone color) see examples by Isaac Newton, D. D. Jameson and A. W. Rimmington. More recenlty, 20th century painters such as Kandinsky have also been captivated by the translation between the visual and the sonic domains, describing his paintings as compositions or symphonies, comprised of visual “chords”.\nThe availability of opensource software and hardware environments during the last decades have led to further experimentation with these ideas and take the form of new musical interfaces such as Imogen Heap's gloves, experimental sound tools like SUFI Plugins and new instruments like Amit Pitaru's Sonic Wire Sculpture. More examples of can be found in the analog synthesizer community, published as smartphone applications or websites, as addons to existing music production suites or as stand alone applications.",
         "titlegray": 255,
         "fullpageimage": "instrument/levin-lieberman.jpg",
         "layout": 20,
         "image": "instrument/pitaru_282x210.jpg\ninstrument/heap_282x210.jpg\ninstrument/rokeby_282x136.jpg\ninstrument/sufi_282x136.jpg\ninstrument/patatap_282x136.jpg",
         "aspirationcaptions": "1. The Manual Input Work Station, 2004 by Golan Levin and Zach Lieberman. http://flong.com/projects/miw/\n2. Sonic Wire Sculpture by Amit Pitaru. http://sws.cc/index.html\n3. Imogen Heap‘s software gloves. http://imogenheap.com/home.php?  \n4. David Rokeby’s Very Nervous System (1982-1991). http://www.davidrokeby.com/vns.html \n5. SUFI PLUG INS by Jace Clayton. http://www.beyond-digital.org/sufiplugins/\n6. Patatap by Jono Brandel and Lullatone. http://patatap.com/\n\n\n",
         "additionalreferences": "Rebecca Fiebrink’s Wekinator software tools. http://www.wekinator.org/downloads/\nAlison Parish makes instruments for writing that take on the principles of musical instruments.  http://www.decontextualize.com/projects/nite/\nCory Arcangel, Keyboard Instruments. http://www.coryarcangel.com/things-i-made/2009-003-dreiklavierstucke-op-11"
     }
]