[
    {
        "in": 1,
        "titles": "The Clock",
        "shortdescription": "Representing time",
        "level": "All levels",
        "tagsstem": "measurement, data visualization",
        "tagsarts": "time, rhythm, dynamism, animation",
        "learningobjectives": "•  Become acquainted with the history of systems and devices for timekeeping\n•  Devise technologies and graphic concepts for representing time that go beyond conventional methods of visualization and mediation\n•  Refine craft skills in the use of programming to control shape, color, form, and motion",
        "brief": "Design a ‘visual clock’ that displays a novel or unconventional representation of the time. It is not essential that the time of day be literally readable from it, but your clock should appear different at all times of the day, and it should repeat its appearance every 24 hours (or other relevant cycle, if desired).\n\nYou are encouraged to seriously question basic assumptions about how time is mediated and represented. Ponder things like biological time (chronobiology), ultradian and infradian rhythms, solar and lunar cycles, celestial time, decimal time, metric time, geological time, historical time, psychological time, and subjective time. Inform your design by reading about the history of timekeeping systems and devices, and their transformative effects on society.",
        "variations": "•  Feel free to experiment with any of the tools at your disposal, including transparency, color, sound, dynamism, and physical actuation. Reactivity to the cursor is optional. \n•  You're strictly prohibited from using Roman, Arabic, or Chinese numerals. However, you may still make the time literally readable through other means, such as by visualizing numeric bit patterns, or using iteration to present countable graphic elements.\n•  Your code will need to access the current hour(), minute(), second(), and potentially the millis(). However, you could also access the day(), month(), and year(), for a clock which changes over the seasons or human lifespans.\n•  Develop your clock for a portable or wearable device, such as a mobile phone, smart watch, fitness tracker, or other standalone computer with a small display. Consider incorporating data from your device’s other sensors into your design, such as a user’s image, movements, body temperature, heartbeat, etc.\n•  Free yourself from the desktop or laptop screen, and design your clock for a context of your own choosing. If you could place your clock anywhere, where would it be? On the side of a building? As a piece of furniture? In someone’s pocket? Or as a digital tattoo? Include a drawing, rendering or other mockup showing your clock as you imagine it *in situ.* ",
        "makingitmeaningful": "Attempts to mark time stretch back many thousands of years, with some of the earliest timekeeping technologies being gnomons, sundials, water clocks, and lunar calendars. Even today’s standard representation of time, with hours and minutes divided into 60 parts, is a legacy inherited from the ancient Sumerians, who used a sexagesimal counting system.\n\nThe history of timekeeping is the history of a still unfolding relationship between technological developments and a social pressure for greater precision, accuracy, and synchronization. Every increase in our ability to precisely measure time has had a profound impact on our mastery of science, agriculture, navigation, communications, and as always, warcraft.\n\nDespite the widespread adoption of machinic standards, there are many other ways to understand time. Psychological time contracts and expands with attention; biological cycles affect our moods and behavior; geological or planetary rhythms can span millenia. In the 20th century, Einstein’s theory of relativity further upended our understanding of time, showing that it does not flow in a constant way, but rather in relation to the position from which it is measured, a possibly surprising return to the significance of the observer.",
        "titlegray": 255,
        "fullpageimage": "clock/lee_byron_fullpage_666x522.png",
        "layout": 8,
        "image": "clock/maeda_clocks_282x136.png\nclock/standardtime_282x136.jpg\nclock/banded_clock_282x136.jpg\nclock/lastclock-282x136.jpg\nclock/moniker_all_the_minutes_282x136.png\nclock/oscar_diaz_ink_calendar_282x136.jpg",
        "aspirationcaptions": "1. Lee Byron's *Center Clock* (2007) presents the time as countable, bouncy circles. Sixty white \"second\" circles will coalesce to form a violet \"minute\" circle, and so on. http://leebyron.com/centerclock/\n\n2. Maeda, John. *12 O’Clocks* (1996) is one of the first responses to this brief, developed in 1996-97 for Classic Mac OS.\n\n3. Formanek, Mark. *Standard Time* (2003) is a video of 70 workers building a wooden 4 x 12 m \"digital\" time display in real time.\n\n4. Levin, Golan. *Banded Clock* was created for John Maeda's Aesthetics and Computation group at MIT. Seconds, minutes and hours of the current time is shown as a series of striated bands.\n\n5. Angesleva, Jussi & Ross Cooper. *Last Clock* (2002) is made from live video feed and as the hands rotate around the face of the clock they leave a trace of pixels from the camera.\n\n6. Studio Moniker. *All the Minutes* (2014). A twitter bot retweeting mentions of the time, minute by minute. Online: https://twitter.com/alltheminutes\n\n7. Diaz, Oscar. *Ink Calendar.* (2009) uses the capillary action of ink spreading across paper to display the date.",
        "additionalreferences": "Biegert & Funk. *Qlocktwo.*\nCharity, Mitchell N. *Dot Clock,* 2001.\nDrucker, Johanna. \"Timekeeping\". In *Graphesis: Visual Forms of Knowledge Production.* Harvard, 2014.\nFoer, Joshua. \"A Minor History of Time Without Clocks\". *Cabinet Magazine,* Issue 29, 2008.\nGiffen, Daniel Craig. *Human Clock,* 2001.\nGroom, Amelia. *Time (Documents of Contemporary Art.* MIT Press, 2013.\nHillis, Danny et al. *The Clock of the Long Now.*\nHumansSince1982. *The Clock Clock.*\nLevin, Golan. *Clocks in New Media.* 2016.\nLewis, Richard. \"How Different Cultures Understand Time\". *Business Insider,* 6/1/2014.\nMarclay, Christian. *The Clock,* 2010.\nMorzier, Eric. *Horloge Tactile,* 2005.\nMulder, Sander. *Continue Time,* 2007.\nMulder, Sander. *Pong Clock,* 2005.\nNakamura, Yugo. *Industrious Clock,* 2001.\nPaterson, Katie. Time Pieces, 2014. http://www.katiepaterson.org/timepieces/\nSaqoosha. *Sonicode Clock,* 2008.\nTseng, Yen-Wen. *Hand in Hand.*"
    }
]
