[
    {
        "in": 1,
        "titles": "Augmented Projection",
        "section": "Transmediality",
        "shortdescription": "Illuminating Interventions",
        "level": "All levels ",
        "tagsstem": "simulation, physics, geometry, perspective",
        "tagsarts": "animation, gesture, architecture, site",
        "learningobjectives": "•  To develop a familiarity in working with projectors.\n•  To develop and realize a site specific artistic concept.\n•  To create a animation that responds to the constraints of the installation site. ",
        "brief": "Design a virtual decal for a physical place or object: a time-based video projection that is specifically composed to illuminate a site *other* than a blank projection screen. Your imagery might respond to (and elicit new meanings from) otherwise banal features in a wall, such as a power outlet, doorknob, water spigot, elevator buttons, window frame, door jamb, etc. Or you might design a projection for a specific object, or even, if you are able, a dynamic site such as a performer’s body. \n\nSketch some poetic concepts for imagery that relates in a non-arbitrary way to the (geometric, political...) features of your site. Create your concept in code, and project your imagery onto your site. You may need a keystoning library or other tool for perspective warping to make projector calibration easier.",
        "variations": "•  Use a physics library to manage the collision of shapes in your animation. \n•  Make your animation responsive to passersby.\n\nCHOICE of WHAT to project on (\"canvas\"), and WHAT to project on it. content relationship\nGEOMETRIC, FORMAL relationship between projected image and its canvas, in which the projected image appears to respond to inherent features of the site (formal relationship between virtual and physical)\nOne level deeper: displaying internal structure (X-ray), institutional critique, revealing the politics that underlie architecture, monuments, and objects\n\nmethods of alignment: None, Keystoning, Taping & Measuring, Computer Vision\nScale: very small to very large\nSubject or projector could be moving or still ",
        "advancedstudents": "•  Combine this with the simulation/living creature assignment and create an ecosystem that is projected onto a chosen wall and responds to its features.",
        "hyphenatemim": 0,
        "makingitmeaningful": "Augmented projections connect virtual and physical space. They are ephemeral artistic interventions addressing architecture and site. Projection works range in scale from spectacular public works that appear to make buildings shake and shimmer, through to small poetic gestures at operate at the scale of a human hand. This genre demands an engagement with the geometric properties of a site, and the formal relationship between projected image and the chosen canvas. Shadows can be manipulated or internal structures can be revealed. Projection works obtain a special power when they also explore a site's history and meaning as can be seen in the work of Kristoph Wodisko that probes the inheretn politics of architectures, monuments and objects. In a performance context, augemented projections provide new opportunities for responsive set design and choreography as seen in the work of Klaus Obermaier or dance company Chunky Move.",
        "titlegray": 255,
        "fullpageimage": "augmented_projection/wodiczko_fullpage.jpg",
        "layout": 20,
        "image": "augmented_projection/naimark_displacements_quarter_1.jpg\naugmented_projection/mckay_sunsetsolitaire_quarter.jpg\naugmented_projection/obermaier_apparition_onethird_1.jpg\naugmented_projection/jillian_mayer_onethird_6.jpg\naugmented_projection/peyton_keyfleas_onethird_2x.png",
        "imageborders": "0\n0\n0\n0\n0",
        "aspirationcaptions": "1. Krysztof Wodiczo's *Warsaw Projection* (2005) augmented the façade of the Zachęta National Gallery to focus on the unequal social status of women. Videos of female figures supporting an entablature with the inscription \"Artibus\" (arts) were presented in the role of architectural Caryatids. http://www.art21.org/artists/krzysztof-wodiczko\n\n2. In Michael Naimark's classic *Displacements* (1980), video of a room-sized still life is projected back onto the scene, after the objects have been painted white. http://www.naimark.net/projects/displacements.html\n\n3. With custom software created for *Sunset Solitaire* (2007), Joe McKay performs a projection which \"matches\" the sunset. http://www.joemckaystudio.com/sunset.php\n\n4. *Apparition* (2004), developed by Klaus Obermaier at the Ars Electronica Futurelab, uses computer vision to project imagery onto a moving dancer's body. \n\n5. In *Scenic Jogging* (2010), Jillian Mayer enters a landscape projected from a moving vehicle. https://youtu.be/uMq9Th3NgGk\n\n6. First-year student Miles Peyton developed playful *Keyfleas* (2013), virtual bugs which respond to the user's keypresses. https://vimeo.com/151334392",
        "additionalreferences": "Baker, Chris. *Architectural Integration Tests* (2009). https://vimeo.com/4500145.\nCone, Justin. \"Building Projection Roundup\". *Motionographer* (2009). http://motionographer.com/2009/07/24/building-projection-round-up/\nForman, Eric. *Perceptio Lucis* (2009). http://www.ericforman.com/perceptio-lucis\nGaulon, Benjamin. *DePong* (2003). http://recyclism.com/deponggame.php\nGuidetti, Michael. *Bounce Room* (2010). http://todayandtomorrow.net/2010/03/12/bounce-room-1-2/\nGysin+Vanetti, *Casse* (2006) http://youtu.be/WY5o2plCfKk\nKarluk, Lukasz. *Snake the Planet!* (2012). https://vimeo.com/37637793\nMunk, Bradley et al.: *BOX* (2013). http://gmunk.com/BOX-DEMO\nMurano, Francesco. \"Light Works: Experimental Projection Mapping\". Politecnico di Milano Press, 2014. \nAntiVJ. *O (Omicron)* (2012). https://vimeo.com/41486619 \nSobecka, Karolina. *WildLife* (2009). http://www.gravitytrap.com/artwork/wildlife\nTODO. *Artificial Dummies* (2007). https://vimeo.com/455512\nValbuena, Pablo. *Augmented Sculpture* (2007). http://pablovalbuena.com/selectedwork/augmented-sculpture-v1/\nYesYesNo. *Night Lights* (2011). https://vimeo.com/26778535\n",
        "notes": "http://cmuems.com/2013/a/assignments/assignment-07/\nhttp://golancourses.net/2015/lectures/interactivity/full-body-interactive-art/\n\npublic space, new audiences, public art. Relationship to the architecture. Geometric, political, architecture and site has an important history. Opportunity for intervention. What makes so many of the eaxmples so poor is that they are purely geometric relationship - this is a great starting point. Making buildings appear to shake and shimmer. But the work obtains special power when it also relates to the history and meaning of site - as wodisko demonstrates. \nPerformance wise- augmented dance projection. \n"
    }
]
